xtee6/asicverifier/src/test/resources/asic-containers/invalid-digest/message.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="MEMBER">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>producer</id:memberCode>
            <id:serviceCode>getState</id:serviceCode>
        </sdsb:service>
        <sdsb:userId>EE:PIN:abc4567</sdsb:userId>
        <sdsb:id>6289448e512292d17d54ef60ed2318e7</sdsb:id>
        <sdsb:issue/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdsb:getState>aäõ</sdsb:getState>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
